import java.io.BufferedReader;
import java.io.FileReader;
import java.io.IOException;
import java.util.Scanner;

public class Novel {
    private String pos;

    public Novel (String novelPos, String novelVarA, String novelVarB, String novelVarC){
        this.pos = novelPos;
    }

    public String switchPos (String choose, String novelPos) {
        String newPos = novelPos;

        if(!choose.equals("Next")) {
            while ( newPos.charAt(newPos.length() - 1) != '-' && newPos.charAt(newPos.length() - 1) != 'A' &&
                    newPos.charAt(newPos.length() - 1) != 'B' && newPos.charAt(newPos.length() - 1) != 'C') {
                newPos = newPos.substring(0, newPos.length() - 1);
                if (newPos.length() == 0) {
                    break;
                }
            }
        }

        switch (choose) {
            case "A" -> {
                return newPos + "A-1";
            }
            case "B" -> {
                return newPos + "B-1";
            }
            case "C" -> {
                return newPos + "C-1";
            }
            case "Next" -> {
                String lastChar = novelPos.substring(novelPos.length() - 1);
                int num = Integer.parseInt(lastChar);
                num = num + 1;
                return novelPos.substring(0, novelPos.length() - 1) + num;
            }
            default -> {return null;}
        }
    }

    public String loopCheck (String novelPos) {
        switch (novelPos) {
            case "A-B-A-B-3" -> {
                return "A-B-A-3";
            }
            case "B-B-A-B-2" -> {
                return "B-B-A-A-1";
            }
            case "B-B-C-A-2" -> {
                return "B-B-C-B-1";
            }
            case "B-B-C-B-B-2" -> {
                return "B-B-C-B-7";
            }
            default -> {return novelPos;}
        }
    }

    public String getChooseA (String novelPos) {
        switch (novelPos){
            case "S" -> {
                return "Вишукане немовлятко з очами-загадками та вогнем-душею";
            }
            case "A-3" -> {
                return "Cказати: \"Що ж ви, батьку, наговорююте на мене. Я ж звичайне дитя, хожду до церки," +
                        " вірую в Бога. Помилуйте та відчіпіться вже\"";
            }
            case "A-A-3" -> {
                return "Серед міста в розікішних хоромах";
            }
            case "A-A-A-2" -> {
                return "Прикинутися мертвою";
            }
            case "A-A-B-1" -> {
                return "Залишитися в хатинці, де народилася дівчина";
            }
            case "A-A-B-A-4" -> {
                return "Відкрити двері";
            }
            case "A-A-B-A-A-9" -> {
                return "Обряд пройде як треба";
            }
            case "A-A-B-A-A-B-5" -> {
                return "Побігти кудись та поблагати про допомогу";
            }
            case "A-A-B-A-B-3" -> {
                return "Розбудити і прогнати";
            }
            case "A-A-B-A-B-B-3" -> {
                return "\"Будь ласка, кхе, кхе.. Не вбивай мене, я піду і бльше ніколи кхе, кхе.. не повернусь сюди\"";
            }
            case "A-A-B-B-4" -> {
                return "Вона обрала вірний шлях";
            }
            case "A-A-B-B-B-10" -> {
                return "Покінчити зі стражданнями";
            }
            case "A-B-4" -> {
                return "Помститись брудним містянам";
            }
            case "A-B-A-3" -> {
                return "Зібрати все спочатку, помста трохи зачекає";
            }
            case "A-B-A-A-12" -> {
                return "Врятувати місто і жителів";
            }
            case "A-B-B-10" -> {
                return "Зіштовхнути вовка з себе";
            }
            case "A-B-B-A-4" -> {
                return "Збрехати";
            }
            case "B-5" -> {
                return "Лікувати за допомогою здібностей до чорної магії";
            }
            case "B-A-2" -> {
                return "Розвивати свої здібності самостійно";
            }
            case "B-A-B-8" -> {
                return "Повернутись до рідного міста";
            }
            case "B-B-4" -> {
                return "Втекти додому";
            }
            case "B-B-A-4" -> {
                return "Вбити Лисичку";
            }
            case "B-B-B-8" -> {
                return "Погодитись";
            }
            case "B-B-C-3" -> {
                return "Спробувати спіймати літаючого зайця";
            }
            case "B-B-C-B-7" -> {
                return "Йти додому та випити протиотруйне зілля";
            }
            default -> {return "Далі";}
        }
    }
    public String getChooseB (String novelPos) {
        switch (novelPos){
            case "S" -> {
                return "Звичайне середньостатистичне дитятко";
            }
            case "A-3" -> {
                return "Плюнути в обличчя та нашепотіти прокльонів на смерть";
            }
            case "A-A-3" -> {
                return "На околицях";
            }
            case "A-A-A-2" -> {
                return "Побігти до сусідки";
            }
            case "A-A-B-1" -> {
                return "Блукати лісом і далі";
            }
            case "A-A-B-A-4" -> {
                return "Тихесенько почекати, поки назнайомець піде";
            }
            case "A-A-B-A-A-9" -> {
                return "Розалінда не зможе завершити зілля";
            }
            case "A-A-B-A-A-B-5" -> {
                return "Почекати поки очі не перестануть боліти";
            }
            case "A-A-B-A-B-3" -> {
                return "Розібратись з ним більш звичним способом";
            }
            case "A-A-B-A-B-B-3" -> {
                return "\"Гори в пеклі, курво!\", це були останні слова невідомого чоловіка";
            }
            case "A-A-B-B-4" -> {
                return "Вона помилилась з вибором шляху";
            }
            case "A-A-B-B-B-10" -> {
                return "Провчити мисливців, які зломили дівчину";
            }
            case "A-B-4" -> {
                return "Відпустити події того дня і творити тільки добро";
            }
            case "A-B-A-3" -> {
                return "Прокрастись вночі додому, та забрати все необхідне";
            }
            case "A-B-A-A-12" -> {
                return "Нехай навічно будуть покарані";
            }
            case "A-B-B-10" -> {
                return "Так і сидіти на місці";
            }
            case "A-B-B-A-4" -> {
                return "Сказати правду";
            }
            case "B-5" -> {
                return "Народні засоби";
            }
            case "B-A-2" -> {
                return "Відправитись на пошуки вчителя";
            }
            case "B-A-B-8" -> {
                return "Залишитись у місті Глостер";
            }
            case "B-B-4" -> {
                return "Спробувати порозмовляти з лисичкою";
            }
            case "B-B-A-4" -> {
                return "Вислухати Лисичку";
            }
            case "B-B-B-8" -> {
                return "Відмовитись";
            }
            case "B-B-C-3" -> {
                return "Взяти пару уроків по літанню у гарненької пташки";
            }
            case "B-B-C-B-7" -> {
                return "З'їсти ще грибів";
            }
            default -> {return null;}
        }
    }
    public String getChooseC (String novelPos) {
        switch (novelPos){
            case "A-A-A-2" -> {
                return "Виплигути у вікнооо";
            }
            case "B-B-4" -> {
                return "З'їсти ще грибів.";
            }
            default -> {return null;}
        }
    }

    public String mainText (String novelPos) {
        switch (novelPos) {
            case "S" -> {
                return "Новела “Ворожка Розалінда. Закляття долі.”\n" +
                        "1702. Baroque era. At this moment in the life of humanity, architecture was born and flourished," +
                        " and art reached the sky. In the forest, late in the evening, when the rain had no limits, a glow shone\n" +
                        "Це маленьке створіння виглядало наче:";
            }
            case "A-1" -> {
                return "В темній кімнаті, де дівчатко з'явилося у світ,  блищали вогники та падали величні тіні на стінах." +
                        " Назвали дитину Розаліндою.\n" +
                        "Немовлятко засліпило сяйвом своїх очей усіх присутніх так сильно, що після цього вони залишилися сліпими.";
            }
            case "A-2" -> {
                return "Після цього по місту поповзли чутки, що темним-темним вечором народилося якесь створіння не від Бога.";
            }
            case "A-3" -> {
                return "В місті почали її ненавидіти та проклинати, тим паче, що перше слово маляти було \"смерть\"\n" +
                        "Одним днем, коли розалінда збиралася йти по трави, її зупинив священник та спитав: \"Знов, нечисте," +
                        " ходиш людям душі травить?\" \n" +
                        "Ваша дія:";
            }
            case "A-A-1" -> {
                return "Пастор плюнув на нeї, перехрестив та й пішов собі, нашіптуючи \"Бог все бачить.\"";
            }
            case "A-A-2" -> {
                return "Пройшло 10 років, у місті про дівчинку ніхто не згадував. Вона собі жила та втиху вирішувала," +
                        " кому город знівечити, кому кота отруїти.";
            }
            case "A-A-3" -> {
                return "І от вже прийшов час вирішити таке, де ж жити, серед міста, чи залишитися на околицях";
            }
            case "A-A-A-1" -> {
                return "Обрала Розалінда шикарні хороми, зі стелею в 4 метри та ліпниною на стінах. Ви б спитали," +
                        " а де взялися гроші? А воно оно як, Розалінда то пішла у крадійки.";
            }
            case "A-A-A-2" -> {
                return "Люд прочув про це та й пішлов брати дівчисько на вила. \"Щож мені робити?\"- шепотіла Розалінда";
            }
            case "A-A-A-A-1" -> {
                return "Скажений люд залітає до її хоромів, кричить \"На вила! На вила!\", дівчині ледве вдалося" +
                        " затримати дихання, але...";
            }
            case "A-A-A-A-2" -> {
                return "В ту ж мить, коли люд майже подумав, що вона мертва, Розалінда гикнула";
            }
            case "A-A-A-A-3" -> {
                return "Чоловік, у якого Розалінда вкрала  коняку і свиней потруїла, і дитину до мавок відправила," +
                        " накинувся та й проштрикнув грудну клітину усіма чотирьма зубчиками. Розалінда видихає в" +
                        " останнє, душа покидає тіло дівичини.";
            }
            case "A-A-A-B-1" -> {
                return "Не стукаючи в двері, дівчина залітає у квартиру сусідки, вельмишановна пані кричить, лається," +
                        " погрожує. Розалінда благає про допомогу, обійцяє їй найкращого життя. Але ця сусідка була невблаганна ";
            }
            case "A-A-A-B-2" -> {
                return "Пані викрикує на усю силу \"Люди! Рятуйте!\"";
            }
            case "A-A-A-B-3" -> {
                return "На крики шановної пані збігаються люди, кричать Розалінді \"Попалася, курво! Ти б ще мертвою прикинулася !\"";
            }
            case "A-A-A-B-4" -> {
                return "Кремезна жінка, у котрої Розалінда увела чоловіка та замучила його, хапає її за горло" +
                        " та буквально перегризає його. На вишуканий килим падає тіло дівчини.";
            }
            case "A-A-A-C-1" -> {
                return "Розалінда розбивається.\n" +
                        "Її  останніми словами було: \"Світ зійшов з розуму, птахи відлетіли\".";
            }
            case "A-A-B-1" -> {
                return "Розалінда блукала по лісу та шукала, куди б їй присунутися. І тут вона побачила закинуту хатину," +
                        " наче старішу за світ.В її очах просяйнулі старі спогади, як вона тут народилася. Розалінда вирішує:";
            }
            case "A-A-B-A-1" -> {
                return "Перше, що довелося зробити- так це прибрати майбутнє місце проживання. Протерти пил, вимити підлогу.";
            }
            case "A-A-B-A-2" -> {
                return "Та й щоб з голоду не померти, наробити запасів на зиму.";
            }
            case "A-A-B-A-3" -> {
                return "Ось так і прошло десь сорок років. Вже жінка, а не дівчина, жила собі у лісі. Варила зілля," +
                        " робила прокльони та просто тихенько поживала.";
            }
            case "A-A-B-A-4" -> {
                return "І тут, в один день, жінці постукали у двері. Вже звикша до відсутності уваги до своєї особистості," +
                        " Розалінда вагалася, відкривати двері чи ні?";
            }
            case "A-A-B-A-A-1" -> {
                return "Перед нею стояв шикрокоплечий чоловік, років десь 30. Очі в нього були наче скляні." +
                        " Перші хвилин 5 вони стояли один навпроти одного та просто дивилися.";
            }
            case "A-A-B-A-A-2" -> {
                return "Першим, слово вимовив чоловік. \"Це ти, Розалінда, дитя не від Бога?" +
                        " Дитя, що ззовні наче ангел, але одним тільки поглядом може осліпити?\"";
            }
            case "A-A-B-A-A-3" -> {
                return "Жінка промовчала. Лише рукою вказала на хатину, мов заходь, не соромся." +
                        " Незнайомець присів на стілець та сказав: \"я чув багато легенд про вас," +
                        " мені потрібна допомога, а саме- помста\" ";
            }
            case "A-A-B-A-A-4" -> {
                return "Розалінда загадково облискнула очима і сказала: \"Розповідай\".";
            }
            case "A-A-B-A-A-5" -> {
                return "Чоловік довго та нудно розповідав про історію свого життя, не пропускаючи жодної деталі." +
                        " Розповідав, як його дружина його покинула, забрала дитину та все майно." +
                        " Але за увесь цей час не проронив жодної сьози. ";
            }
            case "A-A-B-A-A-6" -> {
                return "Під кінець, його язик вже почав заплітатися від втоми, тоді Розалінда сказала:" +
                        " \"Все. Годі. Кажи як саме ти хочеш помститися.\"";
            }
            case "A-A-B-A-A-7" -> {
                return "Від чоловіка далі вона почула тільки одне- \"смерть\".";
            }
            case "A-A-B-A-A-8" -> {
                return "Готувалася до обряду вона недовго, зібрала різних листочків, набрала спеціальної відстояної води." +
                        " Далі, вколола чоловіка у палець та вичавила декілька крапель крові. ";
            }
            case "A-A-B-A-A-9" -> {
                return "Змішавши це все в купу, рідина почала шипіти, щож буде далі??";
            }
            case "A-A-B-A-A-A-1" -> {
                return "Після шипіння рідина значно зменшилася у об'ємі та загусла." +
                        " \"На, підлий їй це у напій або в їжу. Смаку твоя дружина не відчує\", сказала жінка.";
            }
            case "A-A-B-A-A-A-2" -> {
                return "Незнайомець мовчки забрав зілля та пішов від неї." +
                        " В цей момент Розалінда відчула неабияку силу, що наповнила її до країв," +
                        " наче вона була народженна, щоб робити зло. ";
            }
            case "A-A-B-A-A-A-3" -> {
                return "Пройшло 7 днів і в хатинку знов застукали. Це був той же чоловік." +
                        " Він приніс Розалінді квітів та й сказав \"Дякую, моє найбільше бажання було виконано. Я помстився\"";
            }
            case "A-A-B-A-A-A-4" -> {
                return "З тих пір, до відьми почали ходити люди, просити наслати прокльон або зварити нечисте зілля." +
                        " Розалінда все більше й більше почала відчувати свою силу. І так вона доживала своє довге життя," +
                        " нарешті освідомлюючи своє призначення.  ";
            }
            case "A-A-B-A-A-B-1" -> {
                return "Шипляча рідина почала виливатися з тари, на шляху перетворююче все навколо" +
                        " у непридатну  до використання купу.";
            }
            case "A-A-B-A-A-B-2" -> {
                return "Незнайомець та Розалінда відскочили від казана, почали розбігатися. Але рідина була незупинною.";
            }
            case "A-A-B-A-A-B-3" -> {
                return "І тут роздався вибух. Чоловіка не стало у ту ж мить, а жінка змогла вижити тільки завдяки своїй силі. ";
            }
            case "A-A-B-A-A-B-4" -> {
                return "Але очі Розалінди почали пекти та сльозитися, як вона їх не терла, біль ніяк не угамовувася." +
                        " Вона розуміла, якщо біль не піде, то про очі можна було б забути." +
                        " Жінка розплакалася, бо очі це був концентрат її сили. ";
            }
            case "A-A-B-A-A-B-5" -> {
                return "В її мізку крутилося \"Що ж робити? Що ж робити?\" Так і що ж робити?";
            }
            case "A-A-B-A-A-B-A-1" -> {
                return "Вона бігла і бігла, опираючись тільки на свої відчуття. Здавалося, що дорога ніяк не закінчиться. ";
            }
            case "A-A-B-A-A-B-A-2" -> {
                return "Бігла вона до тих пір, поки не вперлася в щось руками. Це була якась стіна." +
                        " І тут до неї долетів чийсь голос: \"Жіночко, що з вами сталося? Вам допомогти?\"";
            }
            case "A-A-B-A-A-B-A-3" -> {
                return "На відповіть у Розалінди вже не було сили, вона каменем впала додолу.";
            }
            case "A-A-B-A-A-B-A-4" -> {
                return "Отямилась Розалінда у незнайомій кімнаті, перше, що вона зробила, це перевірила очі," +
                        " вони були замотані у марлю. З вуст знісся стогін болю.";
            }
            case "A-A-B-A-A-B-A-5" -> {
                return "\"Тихіше, тихіше, скоро буде легше\", казав незнайомий голос. Розалінда знов втратила свідомість. ";
            }
            case "A-A-B-A-A-B-A-6" -> {
                return "В наступний раз, отямившись,болю вона не відчувала, а сили наче стало більше." +
                        " Вона відчула, що до неї підійшов хтось. \"Првіт, я знайшов вас у місті, ви втратили свідомість.\"";
            }
            case "A-A-B-A-A-B-A-7" -> {
                return "Розалінда була очарована голосом чоловіка, цей голос здавався таким оксамитови та ніжним." +
                        " \"Я Розалінда. Звертайтеся до мене так\", збентежено сказала жінка та посміхнулася." +
                        " \"А Ви, до мене, Розаліндо, можете звертатися як до Бажана\".";
            }
            case "A-A-B-A-A-B-A-8" -> {
                return "З тих пір пройшло три роки. Розалінда з Бажаном одружилися, завели дітей." +
                        " І, дивлячись на життя, яке було до втрати очей, Розалінда зрозуміла, що коренем її проблем були" +
                        " саме очі. Це Вони змушували її робити погані речі. Тепер же вона відчувала легкість та радість." +
                        " ЇЇ життя наповнилося сенсом.  ";
            }
            case "A-A-B-A-A-B-B-1" -> {
                return "Розалінда довго терпіла, сиділа біля зруйнованої хатинки та намагалсь думати про що завгодно," +
                        " але тільки не про біль. ";
            }
            case "A-A-B-A-A-B-B-2" -> {
                return "Але це не допомагало, з неї наче випалювало душу разом з очима. ";
            }
            case "A-A-B-A-A-B-B-3" -> {
                return "Жінка вирішила використати магію, але магія перестала працювати." +
                        " І вже ніяка від болю, Розалінда прилягла на землю, та й заснула в сподіванні, що так стане легше.";
            }
            case "A-A-B-A-A-B-B-4" -> {
                return "Прокинулася вона вже вранці, коли пташки співали, а сонце гріло її своїми променями." +
                        " Після сну стало легше, біль відступив, але очі все одно не бачили.";
            }
            case "A-A-B-A-A-B-B-5" -> {
                return "Розалінда піднялася та пішла тихенько лісом." +
                        " Обережні рухалася, протикуючи руками все довкола, щоб не впасти та не понівичитися ще більше.";
            }
            case "A-A-B-A-A-B-B-6" -> {
                return "Години дві вона шла, сподіваючись знайти хоч якесь місце для проживання." +
                        " І ось, вона дійшла до ставка. Вітер пестив її вологим повітрям, а каченята спілкувалися між собою.";
            }
            case "A-A-B-A-A-B-B-7" -> {
                return "Вона відчула, що це її місце вона хоче тет жити, та й витратився тижні на побудлву" +
                        " хоч якогось укриття затаїлася в тому лісі до кінця життя, аж поки час її не забрав.";
            }
            case "A-A-B-A-B-1" -> {
                return "Вона тихенько стала біля дверей і стала прислухатись, чекати поки чоловік піде.";
            }
            case "A-A-B-A-B-2" -> {
                return "Тоді вона ще не знала, що тому чоловіку була необхідна допомога, і він був готовий чекати" +
                        " на віддачу Розалінди скільки завгодно.";
            }
            case "A-A-B-A-B-3" -> {
                return "Минула ніч. Розалінда тихенько підгялнула крізь щелину в двері, і побачила сплячого у неї на" +
                        " порозі чоловічка. Він був змучаним, їй подобалась ця картина. Вона задумалась, що їй з ним робити:";
            }
            case "A-A-B-A-B-A-1" -> {
                return "\"А ну підводься, чого розлігся!? В мене тут не притулок для нещасних. Швидко геть звідси!\"";
            }
            case "A-A-B-A-B-A-2" -> {
                return "Чоловік підвівся, з просоння не розуміючи, що відбувається, почухав потилицю і пішов собі в далечінь лісу.";
            }
            case "A-A-B-A-B-A-3" -> {
                return "Розалінда проводжала його поглядом і єхидно насміхалась, вона знала, що далеко він не зайде.";
            }
            case "A-A-B-A-B-A-4" -> {
                return "Через 2 хвилини, коли слід чоловіка розсіявся в ранковому лісовому тумані, вона почула його" +
                        " крики. Це були лісові мавки. Ще через декілька секунд і усьому лісі настала тиша." +
                        "  Більше її ніхто не потурбує.";
            }
            case "A-A-B-A-B-B-1" -> {
                return "Жінка схопила пляшку з поличики, в ній була невідома, мутна рідина. Здається це якесь зілля." +
                        " Випила його , після чого її очі заблищали як полярна зірка.";
            }
            case "A-A-B-A-B-B-2" -> {
                return "Тихенько, щоб не розбудити чоловіка вона вона підійшла до дверей, ще тихіше відчинила їх," +
                        " і почала нашіптувати якісь заклинання, її слова не віщували добра.";
            }
            case "A-A-B-A-B-B-3" -> {
                return "Коли чоловік все ж таки прокинувся, вже було занадто пізно,її заклинання почало діяти, він" +
                        " не міг поворухнутись. Проте він міг говорити, а точніше тихо стонати.";
            }
            case "A-A-B-A-B-B-A-1" -> {
                return "Розалінда не послухала його благань, промовила останні рядки свого заклинання і" +
                        " чоловік навічно заплющив очі.";
            }
            case "A-A-B-A-B-B-A-2" -> {
                return "Жінка захистила свій будинок, до кінця її існування туди біли ніхто не з'являвся." +
                        " Вона прожила довге життя, не залишився спадкоємців.";
            }
            case "A-A-B-A-B-B-B-1" -> {
                return "Жінка захистила свій будинок, до кінця її існування туди біли ніхто не з'являвся." +
                        " Вона прожила довге життя, не залишився спадкоємців.";
            }
            case "A-A-B-B-1" -> {
                return "Проблукавши до пізньої ночі, дівчина так і не знайшла собі прихистку. Вона заснула під величним дубом";
            }
            case "A-A-B-B-2" -> {
                return "Всю ніч їй снилися жахи, немов вони були віщими. Вона  прокинулась у холодному поті," +
                        " навколо неї вирували ворони- це признак смерті. Вона перелякалась ще більше, проте відступати було пізно.";
            }
            case "A-A-B-B-3" -> {
                return "Оговтавшись, дівчина підвелась з холодної та сирої землі, оглянулась навколо і стала як вкопана." +
                        " Вона не пам'ятала з якої сторони лісу вона прийшла на це місце.";
            }
            case "A-A-B-B-4" -> {
                return "Трохи подумавши, вона обрала маршрут яким піде. Вона була впевнена, що саме за ним вона знайде" +
                        " собі місце проживання.";
            }
            case "A-A-B-B-A-1" -> {
                return "Пройшовши декілька годин, коли сил вже майже не було і ноги благали її зупинитись, між деревами" +
                        " вона помітила якусь хатинку, тому вона якнайшвидше побігла до неї.";
            }
            case "A-A-B-B-A-2" -> {
                return "Прибігши до порогу вона впала і заплакала, дівчина плакала другий раз в житті, перший" +
                        " раз- коли народилась і ось зараз вдруге.";
            }
            case "A-A-B-B-A-3" -> {
                return "Знесилена Розалінда постукала у двері, проте їх ніхто не відчинив. Тому вона вирішила сама їх відчинити.";
            }
            case "A-A-B-B-A-4" -> {
                return "Двері важко і з пронизливим до кісток скрипом відчинились, схоже в середині цього будинка ніхто" +
                        " не з'являвся роками.";
            }
            case "A-A-B-B-A-5" -> {
                return "Оглянувшись, вона зрозуміла, що це ідеальний варінат, який вона так довго шукала.";
            }
            case "A-A-B-B-A-6" -> {
                return "Розалінда швидко освоїлась в новому помешканні, великим плюсом було його місце знаходження." +
                        " В гилибні густого, богом забутому лісі, де її ніхто не буде тривожити. А як хтось і з'явиться," +
                        " всеодно на двого не затримається.";
            }
            case "A-A-B-B-A-7" -> {
                return "Весь останок свого життя, дівчина прожила в цій хатинці, іноді до неї заходили мисливці" +
                        " або блукачі, але ніхто з них ніколи не повертався додому.";
            }
            case "A-A-B-B-A-8" -> {
                return "Подейкують, що вона їх змучувала до смерті, а останній подих чоловіка надавав їй додаткові роки життя.";
            }
            case "A-A-B-B-A-9" -> {
                return "Померла Розалінда у віці 107 років, залишивши після себе 3 доньки і 1 сина. Майбутнє дітей залишилось невідомим.";
            }
            case "A-A-B-B-B-1" -> {
                return "Вирушивши далі на пошук місця де вона буде жити, Розалінду продовжували переслідувати ворони." +
                        " Так лячно їй ще не було ніколи.";
            }
            case "A-A-B-B-B-2" -> {
                return "Метр за метром, крок за кроком заводив її все глибже до лісу, і здавалося б вже немає" +
                        " ніякого нашнсу на порятунок, але..";
            }
            case "A-A-B-B-B-3" -> {
                return "Перед собою дівина побачила чоловіків, вона подумала, що це її шанс на порятунок, вони" +
                        " допоможуть їй або заберуть з собою в найближче місто.";
            }
            case "A-A-B-B-B-4" -> {
                return "Розалінда підійшла до чоловіків і впала їм в ноги не підіймаючи голови, тихо стогнала \"допоможіть, я заблукала\"";
            }
            case "A-A-B-B-B-5" -> {
                return "\"Ох, дівчино, звідки ж ви тут взялись\", запитав чоловік роздивляючись дівчину";
            }
            case "A-A-B-B-B-6" -> {
                return "Розалінда розповіла про останні події її життя, просила чоловіків забрати її з собою місто," +
                        " обіцяла за допомогу начаклувати довгих і забезпечених усіми багатствами світу років життя.";
            }
            case "A-A-B-B-B-7" -> {
                return "Чоловіки гучно засміялись і знову злетілись ці прокляті птахи-вістники смерті. ";
            }
            case "A-A-B-B-B-8" -> {
                return "\"Ти ще не зрозуміла ха-ха, ніхто тебе рятувати не буде\", чоловіки гучно риготали";
            }
            case "A-A-B-B-B-9" -> {
                return "Наступні години життя Розалінди були найпекельнішими в її житті. Дівчиною скористувались як" +
                        " іграшкою і покинули серед лісу, вона плакала і йшла. В очах горіло несамовите полум'я бажаюче" +
                        " помсти, але сльози одразу його гасили.";
            }
            case "A-A-B-B-B-10" -> {
                return "Розалінда дійшла до якогось озера, вона стояла напроти нього, експлозивно кричала." +
                        " В її голову прийшла жахлива ідея:";
            }
            case "A-A-B-B-B-A-1" -> {
                return "Розалінда витерла сльози, зняла з себе сукню, розірвавши її, вона зав'язала петлю і " +
                        "повішалась на дереві. Люди кажуть, що її привид живи біля того озера, чекаючи" +
                        " коли доля подарує їй шанс на помсту.";
            }
            case "A-A-B-B-B-B-1" -> {
                return "Розалінда знайшла на березі камінюку, обв'язавши її шматком сукні," +
                        " вона почала заходити у воду все глибже і глибже.";
            }
            case "A-A-B-B-B-B-2" -> {
                return "Крок за кроком наближав її до неминуючої смерті, але вона знала на що вона йшла.";
            }
            case "A-A-B-B-B-B-3" -> {
                return "Життя покинуло тіло Розалінди. Дівчина перетворилась на лісову мавку.";
            }
            case "A-A-B-B-B-B-4" -> {
                return "Розалінді подабалось її нове так би мовити \"життя\". Вона не відчувала голоду, холоду" +
                        " а головне емоцій, окрім насолоди, яку вона отримувала забираючи до себе на дно чоловіків.";
            }
            case "A-B-1" -> {
                return "Священник від подиву та жаху ледь не впав на місці, а Розалінда тільки" +
                        " розсміялася та ще й додала \"Будь ти проклятий, ти і увесь твій рід\" ";
            }
            case "A-B-2" -> {
                return "Служник Бога взявся за серце та й впав замертво прямо на вулиці. ";
            }
            case "A-B-3" -> {
                return "На те, що відбувається, зійшлися люди, натовп знав на що здатна дівчина," +
                        " але  смерті наймудрішого священника, ще й серед вулиці,  вони точно не очікували.";
            }
            case "A-B-4" -> {
                return "Злий, наляканий та розгублений натовп гнав Розалінду як можна далі від міста:";
            }
            case "A-B-A-1" -> {
                return "Розалінда ледь втекла від розлючених містян. Бігла так довго, що, здавалося," +
                        " ноги ніколи не перестануть боліти . ";
            }
            case "A-B-A-2" -> {
                return "Перші тижні проживання за межами міста були суцільним пеклом," +
                        " але це загартовувало дівчину. Вогняні язики помсти палали в її очах.";
            }
            case "A-B-A-3" -> {
                return "Коли дівчини почала звикати до свого нового образу життя, вона почала продумувати помсту." +
                        " Але в тій халупі, в якій вона оселилась, для початку помсти не вистачало атрибутів," +
                        " які залишились в неї дома.";
            }
            case "A-B-A-B-1" -> {
                return "Вночі дівчина пробралась в квартиру, але в ній були вартові, які очікували," +
                        " що в будь який момент дівчина може з'явитись.";
            }
            case "A-B-A-B-2" -> {
                return "Тому дівчині довелось повернутись в свою хижину і почати все спочатку.";
            }
            case "A-B-A-A-1" -> {
                return "Довгі два роки дівчина нагромаджувала всі трави, опудала тварин, птахів," +
                        " варила зілля, писала усі наговори які пам'ятала ";
            }
            case "A-B-A-A-2" -> {
                return "Врешті-решт, день якого вона так довго чекала настав.";
            }
            case "A-B-A-A-3" -> {
                return "Повний кривавий місяць, ідеальна ніч для того, аби натворити лиха," +
                        " наслати біди на усе місто та його мешканців";
            }
            case "A-B-A-A-4" -> {
                return "прийшовши на центральну вулицю міста, Розалінда навколо себе розлила" +
                        " зілля яке варилось 6 днів, 6 ночей та 6 годин, підняла руки вгори ";
            }
            case "A-B-A-A-5" -> {
                return "та промовила давнє заклинання, яке прокляло все місто та йього мешканців.";
            }
            case "A-B-A-A-6" -> {
                return "Небеса почервоніли,а вітер став сильним, вируючим по вулицям містечка";
            }
            case "A-B-A-A-7" -> {
                return "Місто негайно окуталось магічним покровом,будинки стали непроникними для будь-якої людини";
            }
            case "A-B-A-A-8" -> {
                return "маленькі крамниці знесло вітром, як наче їх ніколи не існувало, а вулиці міста" +
                        " перетворились на лабіринт, який неможливо було пройти.";
            }
            case "A-B-A-A-9" -> {
                return "Кожен мешканець був влучно проклятий, отримавши особливий \"дарунок\" від Розалінди";
            }
            case "A-B-A-A-10" -> {
                return "Одна жінка перетворилась на вовка який до кінця своїх днів бігав по лісу не знаючи людського тепла.";
            }
            case "A-B-A-A-11" -> {
                return "Ще одна жінки отримала у подарунок нескінченний голод, який не можна було нічим задовільнити.";
            }
            case "A-B-A-A-12" -> {
                return "Молодий хлопець став невидимим, і йому задалося, що він більше ніколи" +
                        " не відчує своєї присутності у світі.";
            }
            case "A-B-A-A-A-1" -> {
                return "Однак серед цього хаосу з'явилась дівчина на ім'я Амелія, вона була впевнена," +
                        " що зможе розвіяти прокляття.";
            }
            case "A-B-A-A-A-2" -> {
                return "Амелія почала досліджувати старовинні книги та звертатися до мудреців, щоб знайти відповідь." +
                        " Вона вивчала древні закляття та відвідувала місця магічної сили. З часом, вона знайшла" +
                        " спосіб розкрити прокляття.";
            }
            case "A-B-A-A-A-3" -> {
                return "Амелія зібрала всіх мешканців міста на площі, де було накладене страшне прокляття";
            }
            case "A-B-A-A-A-4" -> {
                return "Вона запропонувала їм взаємодопомогу та згуртування. Вона закликала їх прощати одне" +
                        " одного, проявляти розуміння та співчуття.";
            }
            case "A-B-A-A-A-5" -> {
                return "З кожним теплим словом один до одного, мешканці зігрівали серця один одного." +
                        " І саме це допомагало їм відроджувати нове світло надії.";
            }
            case "A-B-A-A-A-6" -> {
                return "Розпочалася спільна праця і взаємопідтримка. Люди почали відновлювати зв'язки," +
                        " вислуховувати один одного та допомагати у вирішенні проблем. Вони виявили, що" +
                        " магічне прокляття поступово слабшало, коли люди зближувалися й пробивали простір" +
                        " людського співчуття та взаєморозуміння.";
            }
            case "A-B-A-A-A-7" -> {
                return "Поступовов прокляття почало розвіюватись,Конотоп почав знову розквітати. Люди знову" +
                        " раділи сонячним промінчикам,  пускаючи по венам життєрадісність.";
            }
            case "A-B-A-A-A-8" -> {
                return "Розалінда, бачачи, як місто змінюється, відчувала, як уразливість та образа покидають" +
                        " її серце. Вона розуміла, що люди справді заслуговують на милосердя та співчуття. Вона" +
                        " вирішила знести прокляття повністю, пропускаючи свою образу та розпускаючи магічні сили," +
                        " що їх заснували.";
            }
            case "A-B-A-A-A-9" -> {
                return "Вже розуміючі та добрі, люди пробачили Розалінду, вона повернулась до свого будинку." +
                        " Від тоді творила тільки добро, добро і ще раз добро.";
            }
            case "A-B-A-A-B-1" -> {
                return "Ніхто не зміг знайти спосіб розкрити прокляття. Люди здалися на волю невпинного страждання," +
                        " втративши віру і надію. У місті панувала злість, гіркота та безвихідність";
            }
            case "A-B-A-A-B-2" -> {
                return "Історія про це забуте місто і його прокляття залишилася без кінця. Ніхто не з'явився, щоб" +
                        " пробудити людей до життя, навіть самі мешканці не мали сили протистояти прокляттю.";
            }
            case "A-B-A-A-B-3" -> {
                return "Так, трагічна доля спонукало місто, яке впало в вічний мрак. Життя там зникло," +
                        " а пам'ять про нього затяглася в часову прірву.";
            }
            case "A-B-B-1" -> {
                return "Розалінда ледь втекла від розлючених містян. Бігла так довго, що, здавалося," +
                        " ноги ніколи не перестануть боліти . ";
            }
            case "A-B-B-2" -> {
                return "Добігла вона до річки, вмилася та й розплакалася. Вона сумуними очима дивилася" +
                        " на воду та й думала, за що їй це все, вона ж не обирала ким їй народитися.";
            }
            case "A-B-B-3" -> {
                return "Вона ніколи не хотіла когось кривдити, особливо священника, вона просто розгнівалася," +
                        " не знала куди подіти ту лють на жорстоких людей. Не знала, що робити з розчаруванням в собі.";
            }
            case "A-B-B-4" -> {
                return "Плакала вона так аж до ночі, тоді вже й ноги відпочили та й розум заспокоївся." +
                        " На ранок вирішила піти далі. Жити ж десь треба.";
            }
            case "A-B-B-5" -> {
                return "І ось, під перші пташині співи, прокинулася Розалінда, зібралася з духом," +
                        " видихнула та й встала. Час йти далі. ";
            }
            case "A-B-B-6" -> {
                return "Ходила-бродила дівчинка дуже довго, аж поки не натрапила на якесь селище, воно" +
                        " одразу здалось їй дивним. Хаток було не дуже багато, та й невеликі вони були," +
                        " наче не для людей. І що ж робити, залишитися тут, чи йти далі?";
            }
            case "A-B-B-7" -> {
                return "Залишитися в селищі та попросити допомоги";
            }
            case "A-B-B-8" -> {
                return "Розалінда підійшла до хатки, аж тут на неї заплигнуло щось такої сили, що аж повалило з ніг.";
            }
            case "A-B-B-9" -> {
                return "Дівчинка злякалася, побліднішала на очах, та замовкла від шоку.";
            }
            case "A-B-B-10" -> {
                return "Прийшла до тями вона тільки тоді, коли її це \"щось\" лизнуло у щоку." +
                        " Розалінда глянула на створіння: \"О, Боже, це ж вовк!\"";
            }
            case "A-B-B-A-1" -> {
                return "Дівчинка зіштовхнула величезного вовка з себе. Та й хотіла побігти," +
                        " але зробити їй цього не дали. Праворуч від неї з'явився ще більший вовк та й як почав гарчати. ";
            }
            case "A-B-B-A-2" -> {
                return "Розалінда подумала, що це все, гилка, але все не так, як здається." +
                        " Другий вовк,а точніше, вовчиця, взяла Розалінду за одяг та й понесла до однієї з хатинок.";
            }
            case "A-B-B-A-3" -> {
                return "Там, поклала дівчинку на килим. \"Чому це у вовків є хати й килими в хатинках?\"," +
                        " промайнуло в думках Розалінди. ";
            }
            case "A-B-B-A-4" -> {
                return "Аж раптом перед очима не було вовка, то була вже жінка, до того ж дуже гарна. Жінка спитала" +
                        " \"Як тебе звати та що ти робиш на території вовків?\". ";
            }
            case "A-B-B-A-A-1" -> {
                return "Вітаю! Вас з'їв вовк) Не брешіть вовкам, вони все знають!";
            }
            case "A-B-B-A-B-1" -> {
                return "\"Я...я тікала, тікала від людей\", промовила Розалінда. \"Вони думають, що" +
                        " я не від Бога, вони думають, що я вбивця\".";
            }
            case "A-B-B-A-B-2" -> {
                return "Вовчиця лише покачала головою \"Що ж ти такого наробила, що тебе так зненавиділи?\"";
            }
            case "A-B-B-A-B-3" -> {
                return "\"Вбила священника. Але я не хотіла, Богом клянуся, я не хотіла його смерті!\", вже" +
                        " почала емоційніше говорити Розалінда";
            }
            case "A-B-B-A-B-4" -> {
                return "Дівчинка продовжила: \"В мене є дар, я можу робити як погане, так і добро. Будь ласка," +
                        " допоможіть мені, я буду вам також допомагати стільки, скільки ви захочете!\"";
            }
            case "A-B-B-A-B-5" -> {
                return "\"Добре - промовила вовчиця, -залишайся, тільки знай, що поки ти не докажеш свою" +
                        " доброчесність, за тобою буду дивитися особисто я, Зоряна.\"";
            }
            case "A-B-B-A-B-6" -> {
                return "Так пройшло 7 років, Розалінда відчувала себе як вдома, хоча тепер це і є її дім." +
                        " В зграї вовків її поважали, вона допомогала перевертням і вдень, і вночі. ";
            }
            case "A-B-B-A-B-7" -> {
                return "Так і було її життя спокійним, поки не зустріла одного вовка, він прийшов до їхньої" +
                        " зграї сам, його теж вигнали. Звали вовка Мстиславом.";
            }
            case "A-B-B-A-B-8" -> {
                return "Мстислав та Розалінда покохали один одного з першого погляду та з першого дотику." +
                        " Вони зустрічали разом світанки та проводжали заходи сонця." +
                        " А попереду їх чекали безліч років щасливого життя. ";
            }
            case "A-B-B-B-1" -> {
                return "Вітаю! Вас з'їв вовк)";
            }
            case "B-1" -> {
                return "Пологи проходили важко, тож бідна дитина втратила свою матір. Отак і залишилися на світі" +
                        " новонародженна дівчинка Розалінда та її батько. ";
            }
            case "B-2" -> {
                return "Жили вона прямо у центрі Конотопу, всі жителі містечка дуже любили цю маленьку родину" +
                        " та постійно допомагали.";
            }
            case "B-3" -> {
                return "Так і йшли роки, дівчинка вже стала дівчиною, і її батько- старцем. Прийшлось тоді" +
                        " Розалінді вишукувати якусь роботу, то по грядкам допомогати, то наварити їсти комусь.";
            }
            case "B-4" -> {
                return "Але не може життя бути  стабільним завжди, тож одного дня, батько Розалінди захворів тяжкою" +
                        " хворобою і помер. Вмирав він довго та болісно на руках у дівчини. ";
            }
            case "B-5" -> {
                return "Після смерті батка,вбита горем  Розалінда вирішила лікувати людей, щоб вони жили якомога довше." +
                        " Але вона ніяк не могла вирішити якими методати лікувати люд.";
            }
            case "B-A-1" -> {
                return "Дівчина ще з малечку почала помічати, що в неї є надприродні здібності, але ігнорувала їх," +
                        " щоб не лякати людей з міста";
            }
            case "B-A-2" -> {
                return "Проте смерть батька стала великим ударом для дівчини, і вона вирішила, що час настав, треба" +
                        " розвивати свої здібності.";
            }
            case "B-A-A-1" -> {
                return "Розпочала дівчина з вивчення давніх магічних текстів, рецептів зілль, вчилась правильно" +
                        " керувати енергетичним полем.  Навчалась розрізняти різні види хвороб і пробувала різні" +
                        " методи для їх сцілення.";
            }
            case "B-A-A-2" -> {
                return "Для розвитку своїх здібностей Розалінда проводила багато годин навчання і практики." +
                        " Вона вдосконалювала свої навички, що допомагало їй зосередити свою магічну енергію.";
            }
            case "B-A-A-3" -> {
                return "Розалінда також навчалася у інших магів та лікарів, спостерігаючи за ними під час лікування" +
                        " пацієнтів. Вона дізналася про різні ритуали, заклинання та магічні артефакти, які можуть" +
                        " підсилити її здібності. З кожним днем Розалінда все більше розкривала потенціал своїх" +
                        " магічних сил.";
            }
            case "B-A-A-4" -> {
                return "Незабаром Розалінда стала практикувати  лікування  на місцевому населенні. Вона лікувала" +
                        " хворих, використовуючи енергію, що виходила з її рук, та володіла унікальними магічними" +
                        " знаннями та заговорами.";
            }
            case "B-A-A-5" -> {
                return "З кожним успішним лікуванням Розалінда набувала досвіду та відчувала все більшу впевненість у" +
                        " своїх здібностях. Її слава поширювалася по селу  і люди знаходили в неї надію" +
                        " на одужання та зцілення.";
            }
            case "B-A-A-6" -> {
                return "Ворожка Розалінда була щаслива, знаючи, що вона знаходиться на правильному шляху," +
                        " розвиваючи свої магічні здатності, щоб лікувати та полегшувати страждання інших.";
            }
            case "B-A-A-7" -> {
                return "Померла Розалінда щасливою, маючи чудових дітей та люблячого чоловіка. Все місто скорбило" +
                        " такій утраті. Люди сподівались, що її донька замінить її. Так і сталось, але це" +
                        " вже зовсім інша історія.";
            }
            case "B-A-B-1" -> {
                return "Витративши останні відкладені гроші,  дівчина купила старого коня(на жаль грошей вистачило" +
                        " тільки на такого) і на світанку відправилась в далеку мандрівку до відомого" +
                        " на весь світ мага Агнеса";
            }
            case "B-A-B-2" -> {
                return "Шлях до навчання був довгим і тернистим, але загартована болем утрати і великим бажанням," +
                        " дівчина не втрачала зусиль, повільно, але впевнено,  наближалась до міста Глостер. ";
            }
            case "B-A-B-3" -> {
                return "Так пройшло два місяця довгої дороги і нарешті, дівчина дісталась до Глостеру." +
                        " Місто зустріло Розалінду насторожено, вона виглядала ну дуже дивно і навіть моторошно.";
            }
            case "B-A-B-4" -> {
                return "Один місцевий пияка, за два срібляки провів дівчину до будинку на краю міста, це було помешкання Агнеса.";
            }
            case "B-A-B-5" -> {
                return "Розалінда вирішила заночувати на порозі, а вже вранці проситись у великого мага навчати її" +
                        " всьому, що він знає сам.";
            }
            case "B-A-B-6" -> {
                return "Так і сталось, дівчина отримала згоду від Агнеса, він бачив в ній великий потенціал," +
                        " а ще йому потрібно було передати комусь свої сили.";
            }
            case "B-A-B-7" -> {
                return "Промайнуло 12 років, насичені жахами та дивовижними речами,  які важко вкладались в голові дівчини." +
                        " І ось вона вийшла з маєтку Агнеса вже дорослою жінкою з неймовірними силами.";
            }
            case "B-A-B-8" -> {
                return "Тож настав час користвуватись своїми силами:";
            }
            case "B-A-B-A-1" -> {
                return "Після завершення навчання у мага Агнеса,  ворожка Розалінда повернулась до свого рідного міста" +
                        " з великою магічною силою. Вона розуміла, що магія не повинна бути використана лише для" +
                        " власної користі, але й для допомоги людям та створення добра.";
            }
            case "B-A-B-A-2" -> {
                return "Розалінда відкрила свою ворожню в маленькій крамниці з магічними артефактами." +
                        " Люди почали знаходити шлях до неї з різними проблемами та бажаннями. Розалінда" +
                        " уважно слухала їхні історії і знаходила способи, як використати свою магію, щоб допомогти їм.";
            }
            case "B-A-B-A-3" -> {
                return "Новина про дивовижні здібності Розалінди швидко поширилася по місту, і все більше людей" +
                        " зверталися до неї з проханнями про допомогу. Розалінда витрачала безліч годин на вивчення" +
                        " нових заклинань, амулетів і магічних технік, щоб задовольнити потреби своїх клієнтів.";
            }
            case "B-A-B-A-4" -> {
                return "Вона стала відомою як ворожка, яка допомагала людям у найважчі моменти їхнього життя." +
                        " Розалінда використовувала свої магічні здібності для зцілення хвороб, знаходження загублених" +
                        " речей, прогнозування майбутнього та зняття нещастя з долі людей.";
            }
            case "B-A-B-A-5" -> {
                return "Померла Розалінда щасливою, маючи чудових дітей та люблячого чоловіка. Все місто скорбило" +
                        " такій утраті. Люди сподівались, що її донька замінить її. Так і сталось, але це вже зовсім" +
                        " інша історія.";
            }
            case "B-A-B-B-1" -> {
                return "Маючи неймовірну силу, перше, що зробила жінка - приворожила до себе багатого, славного" +
                        " чоловіка, він їй не подобався, але жити десь потрібно було";
            }
            case "B-A-B-B-2" -> {
                return "Він був у захваті від дівчини, але це було не чисте кохання  і невдовзі він укоротив собі віку.";
            }
            case "B-A-B-B-3" -> {
                return "Так Розалінда і залишилась сама у великому маєтку, з прислугою і неймовірною силою.";
            }
            case "B-A-B-B-4" -> {
                return "У місті одразу розповзлись чутки, про сильну дівчину, яка може виконати неможливе";
            }
            case "B-A-B-B-5" -> {
                return "Тому Розалінда невдовзі почала приймати у себе людей, допомагаючи їм помститись або прибрати" +
                        " когось зі свого шляху.";
            }
            case "B-A-B-B-6" -> {
                return "Слава дівчини дуже швидко очорнилась, мирні християни боялись її і обходили стороною." +
                        " А заздрісні, кровожерливі язичники з великим задоволенням користувались послугами Розалінди.";
            }
            case "B-A-B-B-7" -> {
                return "Минали місяці, роки, і Розалінда нарешті наважилась призвати духа свого батька," +
                        " вона дуже сумувала за ним, тому все ж таки вирішила поспілкуватись з ним таким шляхом.";
            }
            case "B-A-B-B-8" -> {
                return "Однієї ночі, дівчина вийшла в туманний ліс під повний місяць, з її губ почали витікати" +
                        " заклинання, а навколо неї здіймалась сильна буря, яка зв'язувала її зі світом мертвих";
            }
            case "B-A-B-B-9" -> {
                return "Поступово, серед темряви, з'явився чоловічий силует. Розалінда відчула" +
                        " велику радість у своєму серці, думаючи, що нарешті зустріла дух свого батька";
            }
            case "B-A-B-B-10" -> {
                return "\"Батьку, я дуже сумувала за тобою\", - сказала Розалінда.";
            }
            case "B-A-B-B-11" -> {
                return "Силует розплівся, а коли фігура розпізналася, Розалінда відчула холод у животі. Це був не її" +
                        " батько. Замість того, Розалінда побачила фігуру свого старого вчителя, мудрого Агнеса";
            }
            case "B-A-B-B-12" -> {
                return "Агнес посміхнувся, але  в його очах було видно рзчарування" +
                        "  \"Розалінда, ученеце моя, ти загубила свою дорогу\", - сказав він.";
            }
            case "B-A-B-B-13" -> {
                return "Розалінда заплакала, відчуваючи глибоке розчарування в собі. Вона розуміла, що заблукала" +
                        " і що вона втратила свою справжню магію, перетворивши її на зло.";
            }
            case "B-A-B-B-14" -> {
                return "Агнес протягнув руку і поміг Розалінді піднятися: \"Ти ще можеш виправити ситуацію і стати на" +
                        " вірний шлях. Повертайся додому і використовуй свою силу для блага людей\".";
            }
            case "B-A-B-B-15" -> {
                return "З глибокою повагою Розалінда схилилася перед Агнесом і обіцяла, що зміниться. Вона вирішила" +
                        " повернутися до свого коріння і віддати себе служінню людям. І тоді, коли вона покладе свою" +
                        " силу в добрі справи, вона знову знайде свого батька, щасливого і гордого за свою доньку.";
            }
            case "B-A-B-B-16" -> {
                return "З того дня Розалінда розпочала нову главу свого життя. Вона стала відомою як ворожка, яка" +
                        " використовує свою магію, щоб лікувати хворих, заспокоювати розлючених і допомагати потребуючим." +
                        " І в її серці завжди горіла надія на зустріч з батьком, коли вона врешті заслужить його прощення.";
            }
            case "B-B-1" -> {
                return "По-перше, Розалінда пішла у бібліотеку, бо їй потрібно було навчитися багатьом рецептам." +
                        " Тож вона набрала купу книжок додому та вперто їх вивчала. ";
            }
            case "B-B-2" -> {
                return "І вже коли дівчина наче була готовою починати практику на людях, стався цікавий випадок." +
                        " Одного весняного ранку, Розалінда збиралася йти за травами у ліс, вона вдяглася, вмилася" +
                        " та вирушила у путь. І як тіки но дівчина опинилася в лісі, до неї заговорила лисичка, яка" +
                        " жила на краю ліса. ";
            }
            case "B-B-3" -> {
                return "\"Зачекай но, сестричко, не поспішай так, мені потрібна твоя допомога\", сказала лисичка." +
                        " Розалінда на це тільки здивовано відкрила рота. \"Невже це так подіяли гриби, які я їла на сніданок?\"," +
                        " подумалося Розалінді.";
            }
            case "B-B-4" -> {
                return "Дівчина не знала, що з цим робити.";
            }
            case "B-B-A-1" -> {
                return "Прибігши додому Розалінда вирішила проспатись. Прокинувшись серед ночі вона подумала:\"оце" +
                        " так привидилось. оце так грибочки, більше не буду їх їсти.\"";
            }
            case "B-B-A-2" -> {
                return "Дочекавшись ранку, вона знову вирушила до лісу збирати трави. Збір трав проходив відмінно," +
                        " вона зібрала всі необхідні трави-мурави і рушила додому. По дорозі додому  вона знову зустріла" +
                        " лисичку, а та знову до неї заговорила:";
            }
            case "B-B-A-3" -> {
                return "\"Я знала, що ти повернешся, і чекала на тебе\",-сказала руденька мешканка лісу. ";
            }
            case "B-B-A-4" -> {
                return "\"О сили небесні, що ж таке, я ж не їла більше грибів, чому мені знову ця лисиця мариться!?\"";
            }
            case "B-B-A-B-1" -> {
                return "Розалінда вислухала руду, але все ще не могла повірити в її рельність, тому..";
            }
            case "B-B-A-A-1" -> {
                return "Розгублена Розалінда напала на бідну лисичку і пошматувала її ножем. Тільки після того як вона" +
                        " побачила кров на свої руках, було зрозуміло, що лисиця була справжньою.";
            }
            case "B-B-A-A-2" -> {
                return "Згодом дівчина так і не навчилась компонувати між собою трави, та щоб не труїти людей," +
                        " перестала практикувати лікувати. Та й не навчилась правильно використовувати свої здібності.";
            }
            case "B-B-A-A-3" -> {
                return "Прожила вона не довго, отруївшись черговим невдачним зіллям, вона  померла виснажена сидячи" +
                        " на нічному горщику.";
            }
            case "B-B-B-1" -> {
                return "Розалінда підійшла до лисички і спитала: \"Ти справжня?Чому я тебе чую?\". Лисичка відповіла: \"" +
                        "Не переживай, я справжня, а чуєш ти мене тому що в тобі схована велика сила.\"";
            }
            case "B-B-B-2" -> {
                return "\"Що? Яка сила? Це точно не ранкові гриби?\"- аж прикрикнула дівчина." +
                        " Лисичка на це відповіла: \"Йди за мною і все зрозумієш\". ";
            }
            case "B-B-B-3" -> {
                return "Розалінда разом з лисичкою-сестричкою пішли вглиб лісу. Йшли вони не дуже довго," +
                        " але Розалінда вже почала помічати дивні речі.  ";
            }
            case "B-B-B-4" -> {
                return "То листя дерева до неї притягнеться, то квітка на очах розквітне. А то і вовченя" +
                        " підбіжить до неї щоб його попестили.";
            }
            case "B-B-B-5" -> {
                return "Так і дійшли вони до галявини, на ній було величезне дерево, усе у рожевих квітах." +
                        " Лисичка підбігла до дерева та вказала мордою на рослину.";
            }
            case "B-B-B-6" -> {
                return "Розалінда торкнулася стовбура і з  щілин почало наче виливатися світло." +
                        " В цей момент дівчина відчула неабияку силу, яка наповнювала її с голови до п'ят.";
            }
            case "B-B-B-7" -> {
                return "\"Ось про що я казала\", -мовила лисиця, - в тобі тече кров наших предків лисиць." +
                        " Тому ти можеш мене зрозуміти. Насправді, нам потрібна твоя допомога.\"";
            }
            case "B-B-B-8" -> {
                return "\"Нам потрібен захист, бо мисливці хочуть нас вбити\",- благала лисиця. ";
            }
            case "B-B-B-A-1" -> {
                return "\"Так, добре, якщо це принесе вам добро, то я згодна\", - сказала дівчина." +
                        " Після цього лисичка повела Розалінду до свого поселення.";
            }
            case "B-B-B-A-2" -> {
                return "В посленні лисиць її добряче нагодували, вдягли та провели екскурсію. \"Все, що нам треба- це" +
                        " те, щоб ти знаходилася з нами та відбивала атаки мисливців. Для цього ми покажемо тобі один" +
                        " магічний ритуал, ти готова?\"";
            }
            case "B-B-B-A-3" -> {
                return "\"Так, я готова\",- відповіла дівчина. Лисиці повели її за поселення, до річки. Там вже було" +
                        " готове місце для ритуалу: на землі було намальоване коло, також по всьому периметру" +
                        " були розставлені камінці.";
            }
            case "B-B-B-A-4" -> {
                return "В центрі стояло якесь пугалище. Далі Розалінда повторювала за лисицями: підійшла до пугалища," +
                        " поклала йому в ноги камінюку. ";
            }
            case "B-B-B-A-5" -> {
                return "І тут раптом на неї накинулася одна з лисиць та вдарила Розалінду ножем у груди. Дівчина" +
                        " почала стікати кров'ю. Там вона і полягла, в ритуальному колі";
            }
            case "B-B-B-A-6" -> {
                return " Не просто так лисиць називають хитрими тваринами. Вони використали Розалінду для свого ритуалу," +
                        " який принесе їм довічний захист. Так ця історія і закінчилася.";
            }
            case "B-B-B-B-1" -> {
                return "\"Ні, не буду, в мене є свої справи і якого біса ти взагалі до мене причепилася?\"," +
                        "- сказала роздратовано Розалінда.";
            }
            case "B-B-B-B-2" -> {
                return "ЇЇ дуже розізлив той факт, що нагла лисиця поставилася до неї як до звичайного інструменту" +
                        " захисту. Розалінда знала, що варта більшого. ";
            }
            case "B-B-B-B-3" -> {
                return "Тому вона одразу ж побігла додому, бачити той ліс вона вже не хотіла. Вдома Розалінда" +
                        " приготувала настоянку, яку і випила на обід. Розалідні дуже хотілося розслабитися" +
                        " та відпочити, бо навчання забирало дуже багато сил.";
            }
            case "B-B-B-B-4" -> {
                return "Випивши настоянку, дівчина вляглася поспати. Їй снилися лисиці, вони приходили до неї" +
                        " та робили заговори на невдачі. Тож прокинулася Розалінда в поганому настрої.";
            }
            case "B-B-B-B-5" -> {
                return "Вона вирішила піти назад до лисички в ліс та вибачитись за грубість, бо по-перше, може" +
                        " лисицям дійсно дуже потрібен був захист, а по-друге, вона не хотіла невдач у житті.";
            }
            case "B-B-B-B-6" -> {
                return "Прийшла Розалінда в ліс вже під вечір. Шукала цю лисицю годин 6, але так її і не знайшла.";
            }
            case "B-B-B-B-7" -> {
                return "Пішла дівчина додому з відчуттям провини, але що зроблено- то зроблено. ";
            }
            case "B-B-B-B-8" -> {
                return "Так і проходили дні далі, Розалінда навчалася та й навчалася, але в неї перестали" +
                        " виходити зілля. Вони більше не були дієвими, а про практику лікування можна було забути.";
            }
            case "B-B-B-B-9" -> {
                return "Так і прожила своє життя Розалінда, підпрацьовуючи то тут, то там. Родини в неї не було," +
                        " а життя було сповнене невдачами.";
            }
            case "B-B-C-1" -> {
                return "Розалінда, довго не думаючи, побігла трохи всередину лісу, знайшла там грибів," +
                        " які вона їла зранку та, прямо на місці, з'їла їх цілу жменю.";
            }
            case "B-B-C-2" -> {
                return "Хвилин через 5, у дівчини віднявся язик, а ноги так і просили присісти." +
                        " Так Розалінда і зробила, сіла на галявинці та витріщилася вперед.  ";
            }
            case "B-B-C-3" -> {
                return "Перед нею почали з'являтися різні фігури, тварини, люди, вони все до неї балакали" +
                        " та й балакали. Але Розалінда не могла їм відповісти. Тоді вона вирішила: ";
            }
            case "B-B-C-A-1" -> {
                return "Ледь вставши на ноги, Розалінда почала ганятися за зайчиком. Він літав так хутко," +
                        " що дівчина за ним не встигала, тому вона вирішила все ж таки прийняти пропозицію" +
                        " гарненької пташки та навчитися літати. ";
            }
            case "B-B-C-B-1" -> {
                return "Розалінда підійшла до пташини та й каже: \"ГЕЙ, давай розказуй, показуй мені що і як робити\"";
            }
            case "B-B-C-B-2" -> {
                return "Пташка тільки цвірінькнула та показала на дерево крилом. \"Зрозуміла\", - сказала Розалінда" +
                        " та почала вилазити на дерево. Лізла вона довго та було моментами, що наче й впаде. Але ні," +
                        " дівчина шкидко вчилася, тож на дерево вона все ж таки залізла.";
            }
            case "B-B-C-B-3" -> {
                return "\"А тепер що??\",- знов крикнула пташці Розалінда. На це пташка пролетіла навколо себе" +
                        " та здійнялася то вперед, то вгору. ";
            }
            case "B-B-C-B-4" -> {
                return "Розалінда прийняла рішення повторити за пташкою, піднялася на ноги, розправила руки та й" +
                        " як полетіла до низу, що аж в повітрі засвистіло.";
            }
            case "B-B-C-B-5" -> {
                return "На жаль, приземлення було зовсім не м'яким, але, на своє здивування, на Розалінді не було" +
                        " жодної подряпини. Дівчина встала та подивилася на свої руки, бо почала відчувати поколювання в них. ";
            }
            case "B-B-C-B-6" -> {
                return "І тут в голові різко просвітлішало, дівчина оглянулася, вже був вечір, вона сиділа там," +
                        " на галявині, де з'їла грибів. \"Отож бо!\", -викрикнула Розалінда. Що ж робити далі?";
            }
            case "B-B-C-B-7" -> {
                return "Що ж робити далі?";
            }
            case "B-B-C-B-B-1" -> {
                return "повідомлення:\n" +
                        "\"Це дуже погана ідея!\"";
            }
            case "B-B-C-B-A-1" -> {
                return "Голова кружляла, очі бігали туди-сюди, а руки тремтіли. Ледь-ледь, Розалінда" +
                        "дійшла до свого дому. Випила пляшечку зілля.";
            }
            case "B-B-C-B-A-2" -> {
                return "На ранок їй полегшало, але тепер Розалінда остаточно вирішила, що ну його, до чорта," +
                        " те лікування людей.";
            }
            case "B-B-C-B-A-3" -> {
                return "Так Розалінда і прожила своє життя, вийшла заміж, понароджувала дітей. Але вона так і не" +
                        " дізналася, що в неї була величезна сила, яку можна було використати з користю. А лисичка" +
                        " в лісі розмовляла до Розалінди не через гриби, а через те, що побачила у Розалінді ту силу.";
            }
        }
        return null;
    }

    public boolean finalCheck (String novelPos) {
        switch (novelPos){
            case "A-A-A-A-4", "B-B-C-B-A-4", "B-B-B-B-10",
                    "B-B-B-A-7", "B-B-A-A-4", "B-A-B-B-17",
                    "B-A-B-A-6", "B-A-A-8", "A-B-B-B-2",
                    "A-B-B-A-B-9", "A-B-B-A-A-2", "A-B-A-A-B-4",
                    "A-B-A-A-A-10", "A-A-B-B-B-B-5", "A-A-B-B-B-A-2",
                    "A-A-B-B-A-10", "A-A-B-A-B-B-B-2", "A-A-B-A-B-B-A-3",
                    "A-A-B-A-B-A-5", "A-A-B-A-A-B-B-8", "A-A-B-A-A-B-A-9",
                    "A-A-B-A-A-A-5", "A-A-A-C-2", "A-A-A-B-5" -> {
                return true;
            }
            default -> {return false;}
        }
    }

    public String getPos () {
        return pos;
    }
    public void setPos (String pos){
        this.pos = pos;
    }

}
